app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "207281424"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 21 Aug 2014 10:06:36 UTC +00:00], ["updated_at", Thu, 21 Aug 2014 10:06:36 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", Thu, 21 Aug 2014 13:23:35 UTC +00:00], ["product_id", 207281424], ["quantity", 1], ["updated_at", Thu, 21 Aug 2014 13:23:35 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2014-08-21 12:31:30.448068' WHERE "line_items"."id" = 1